Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J21.e.tmx
Source language: en_us
Languages: zh_cn

source: Chapter 10 Graphs
zh_cn: 第十章 图

source: Graphs are discrete structures consisting of vertices and edges that connect these vertices.
zh_cn: 图是由顶点和连接顶点的边构成的离散结构。

source: There are different kinds of graphs, depending on whether edges have directions, whether multiple edges can connect the same pair of vertices, and whether loops are allowed.
zh_cn: 根据图中的边是否有方向、相同顶点对之间是否可以有多条边相连以及是否允许存在自环，图可以分为多种不同的类型。

source: Problems in almost every conceivable discipline can be solved using graph models.
zh_cn: 几乎可以想到的每种学科中的问题都可以运用图模型来求解。

source: We will give examples to illustrate how graphs are used as models in a variety of areas.
zh_cn: 我们将举例说明如何在各种领域中运用图来建模。

source: For instance, we will show how graphs are used to represent the competition of different species in an ecological niche, how graphs are used to represent who influences whom in an organization, and how graphs are used to represent the outcomes of round-robin tournaments.
zh_cn: 例如，如何用图表示生态环境中不同物种的竞争、如何用图表示组织中谁影响谁、如何用图表示循环锦标赛的结果。

source: We will describe how graphs can be used to model acquaintanceships between people, collaboration between researchers, telephone calls between telephone numbers, and links between websites.
zh_cn: 我们将描述如何用图对人们之间的相识关系、研究人员之间的合作关系、电话号码间的呼叫关系以及网站之间的链接关系进行建模。

source: We will show how graphs can be used to model roadmaps and the assignment of jobs to employees of an organization.
zh_cn: 我们将说明如何用图对路线图和一个组织内员工的工作指派进行建模。

source: Using graph models, we can determine whether it is possible to walk down all the streets in a city without going down a street twice, and we can find the number of colors needed to color the regions of a map.
zh_cn: 运用图模型，可以确定能不能遍历一个城市的所有街道而不在任一条街道上走两遍，还能找出对地图上的区域着色所需要的颜色数。

source: Graphs can be used to determine whether a circuit can be implemented on a planar circuit board.
zh_cn: 可以用图来确定某一个电路是否能够在平面电路板上实现。

source: We can distinguish between two chemical compounds with the same molecular formula but different structures using graphs.
zh_cn: 用图可以区分有着同样的分子式但结构不同的两种化合物。

source: We can determine whether two computers are connected by a communications link using graph models of computer networks.
zh_cn: 我们能够运用计算机网络的图模型确定两台计算机是否由通信链路连接。

source: Graphs with weights assigned to their edges can be used to solve problems such as finding the shortest path between two cities in a transportation network.
zh_cn: 对其边赋予了权重的图可以求解诸如传输网络中两个城市间的最短路径这类的问题。

source: We can also use graphs to schedule exams and assign channels to television stations.
zh_cn: 我们还可以用图来安排考试和指定电视台的频道。

source: This chapter will introduce the basic concepts of graph theory and present many different graph models.
zh_cn: 本章将介绍图论的基本概念，还将给出许多不同的图模型。

source: To solve the wide variety of problems that can be studied using graphs, we will introduce many different graph algorithms. We will also study the complexity of these algorithms.
zh_cn: 为了求解能够用图研究的多种问题，我们将介绍许多不同的图的算法，还将研究这些算法的复杂度。

source: 10.1 Graphs and Graph Models
zh_cn: 10.1图和图模型

source: We begin with the definition of a graph.
zh_cn: 首先给出图的定义。

source: DEFINITION 1 A graph G = (V, E) consists of V , a nonempty set of vertices (or nodes) and E, a set of edges. Each edge has either one or two vertices associated with it, called its endpoints.
zh_cn: 定义1 一个图G=（V，E）由顶点（或结点）的非空集V和边的集合E构成，每条边有一个或两个顶点与它相连，这样的顶点称为边的端点。

source: An edge is said to connect its endpoints.
zh_cn: 边连接它的端点。

source: Remark: The set of vertices V of a graph G may be infinite.
zh_cn: 评注 图G的顶点集V可能是无限的。

source: A graph with an infinite vertex set or an infinite number of edges is called an infinite graph, and in comparison, a graph with a finite vertex set and a finite edge set is called a finite graph.
zh_cn: 顶点集为无限集或有无限条边的图称为无限图，与之相比，顶点集和边集为有限集的图称为有限图。

source: In this book we will usually consider only finite graphs.
zh_cn: 在本书中，通常只考虑有限图。

source: Now suppose that a network is made up of data centers and communication links between computers.
zh_cn: 现在假设一个网络由数据中心和计算机之间的通信链路组成。

source: We can represent the location of each data center by a point and each communications link by a line segment, as shown in Figure 1.
zh_cn: 可以把每个数据中心的位置用一个点来表示，把每个通信链接用一条段线来表示，如图1所示。

source: This computer network can be modeled using a graph in which the vertices of the graph represent the data centers and the edges represent communication links.
zh_cn: 这个计算机网络可以用图来建模，图中的顶点表示数据中心，边表示通信链接。

source: In general, we visualize graphs by using points to represent vertices and line segments, possibly curved, to represent edges, where the endpoints of a line segment representing an edge are the points representing the endpoints of the edge.
zh_cn: 通常，用点表示顶点、用线段或者曲线表示边来可视化图。其中，表示边的线段的端点就是表示相应边的端点的点。

source: When we draw a graph, we generally try to draw edges so that they do not cross.
zh_cn: 当我们画图时，尽量不让它们的边相交。

source: However, this is not necessary because any depiction using points to represent vertices and any form of connection between vertices can be used.
zh_cn: 然而，并不是必须这样做，因为任意的用点表示顶点、用任意形式的顶点间的连接表示边的描述方法均可使用。

source: Indeed, there are some graphs that cannot be drawn in the plane without edges crossing (see Section 10.7).
zh_cn: 实际上，有些图不能够使边不相交地画在平面上（见10.7节）。

source: The key point is that the way we draw a graph is arbitrary, as long as the correct connections between vertices are depicted.
zh_cn: 关键一点是，只要正确地描述了顶点间的连接，画一张图的方式可以是任意的。

source: Note that each edge of the graph representing this computer network connects two different vertices. That is, no edge connects a vertex to itself. Furthermore, no two different edges connect the same pair of vertices.
zh_cn: 注意表示计算机网络的图的每条边都连接着两个不同的顶点，即没有任何一条边仅连接一个顶点自身，另外，也没有两条不同的边连接着一对相同的顶点。

source: A graph in which each edge connects two different vertices and where no two edges connect the same pair of vertices is called a simple graph.
zh_cn: 每条边都连接两个不同的顶点且没有两条不同的边连接一对相同顶点的图称为简单图。

source: Note that in a simple graph, each edge is associated to an unordered pair of vertices, and no other edge is associated to this same edge.
zh_cn: 注意，在简单图中，每条边都与一对无序的顶点相关联，而且没有其他的边和这条边相关联。

source: Consequently, when there is an edge of a simple graph associated to {u, v}, we can also say, without possible confusion, that {u, v} is an edge of the graph.
zh_cn: 因此，在简单图中，当有一条边与｛u，v｝相关联时，也可以说｛u，v｝是该图的一条边，这不会产生误解。

source: A computer network may contain multiple links between data centers, as shown in Figure 2.
zh_cn: 一个计算机网络可能在两个数据中心之间有多重链接，如图2所示。

source: To model such networks we need graphs that have more than one edge connecting the same pair of vertices.
zh_cn: 为这样的网络建模，需要有多条边连接同一对顶点的图。

source: Graphs that may have multiple edges connecting the same vertices are called multigraphs.
zh_cn: 可能会有多重边连接同一对顶点的图称为多重图。

source: When there are m different edges associated to the same unordered pair of vertices {u, v}, we also say that {u, v} is an edge of multiplicity m.
zh_cn: 当有m条不同的边与相同的无序顶点对相关联时，我们也说｛u，v｝是一条多重度为m的边。

source: That is, we can think of this set of edges as m different copies of an edge {u, v}.
zh_cn: 就是说，可以认为这个边集是边｛u，v｝的m个不同副本。

source: Sometimes a communications link connects a data center with itself, perhaps a feedback loop for diagnostic purposes.
zh_cn: 有时候一个数据中心有一条连接自身的通信线路，也许是一个用于诊断的反馈环。

source: Such a network is illustrated in Figure 3.
zh_cn: 图3说明了这样的网络。

source: To model this network we need to include edges that connect a vertex to itself.
zh_cn: 为这个网络建模，需要包括把一个顶点连接到它自身的边。

source: Such edges are called loops, and sometimes we may even have more than one loop at a vertex.
zh_cn: 这样的边称为环。有时，一个顶点可能需要多个环。

source: Graphs that may include loops, and possibly multiple edges connecting the same pair of vertices or a vertex to itself, are sometimes called pseudographs.
zh_cn: 包含环或存在多重边连接同一对顶点或同一个顶点的图，称为伪图。

source: So far the graphs we have introduced are undirected graphs.
zh_cn: 到目前为止，我们所介绍的图是无向图。

source: Their edges are also said to be undirected.
zh_cn: 它们的边也被认为是无向的。

source: However, to construct a graph model, we may find it necessary to assign directions to the edges of a graph.
zh_cn: 然而，要建立一个图模型，可能会发现有必要给这些边赋予方向。

source: For example, in a computer network, some links may operate in only one direction (such links are called single duplex lines).
zh_cn: 例如，在计算机网络中，有些链接只可以对一个方向操作（这种边称为单工线路）。

source: This may be the case if there is a large amount of traffic sent to some data centers, with little or no traffic going in the opposite direction.
zh_cn: 这可能是这种情况，有大量的数据传送到某些数据中心，但只有很少或者根本没有相反方向的数据传输。

source: Such a network is shown in Figure 4.
zh_cn: 这样的网络如图4所示。

source: To model such a computer network we use a directed graph.
zh_cn: 我们使用有向图为这样的计算机网络建模。

source: Each edge of a directed graph is associated to an ordered pair.
zh_cn: 有向图的每条边与一个有序对相关联。

source: The definition of directed graph we give here is more general than the one we used in Chapter 9, where we used directed graphs to represent relations.
zh_cn: 这里给出的有向图的定义比第9章使用的更加广义，在第9章中使用有向图来表示关系。

source: DEFINITION 2 A directed graph (or digraph) (V , E) consists of a nonempty set of vertices V and a set of directed edges (or arcs) E.
zh_cn: 定义2 一个有向图（V，E）由一个非空顶点集V和一个有向边（或弧）集E组成。

source: Each directed edge is associated with an ordered pair of vertices.
zh_cn: 每条有向边与一个顶点有序对相关联。

source: The directed edge associated with the ordered pair (u, v) is said to start at u and end at v.
zh_cn: 与有序对（u，v）相关联的有向边开始于u、结束于v。

source: When we depict a directed graph with a line drawing, we use an arrow pointing from u to v to indicate the direction of an edge that starts at u and ends at v. A directed graph may contain loops and it may contain multiple directed edges that start and end at the same vertices.
zh_cn: 当画线描述一个有向图时，我们用一个从u指向v的箭头来表示这条边的方向是开始于u结束于v一个有向图可能包含环，也有可能包含开始和结束于相同顶点的多重有向边。

source: A directed graph may also contain directed edges that connect vertices u and v in both directions; that is, when a digraph contains an edge from u to v, it may also contain one or more edges from v to u.
zh_cn: 有向图也可能包含连接u和v的两个方向上的有向边，就是说，当一个有向图含有从u到v的边时，它也可能包含从v到u的一条或多条边。

source: Note that we obtain a directed graph when we assign a direction to each edge in an undirected graph.
zh_cn: 注意，当对一个无向图的每一条边都赋予方向后，就得到了一个有向图。

source: When a directed graph has no loops and has no multiple directed edges, it is called a simple directed graph.
zh_cn: 当一个有向图不包含环和多重有向边时，就称为简单有向图。

source: Because a simple directed graph has at most one edge associated to each ordered pair of vertices (u, v), we call (u, v) an edge if there is an edge associated to it in the graph.
zh_cn: 因为在简单有向图中，每个顶点有序对（u，v）之间最多有一条边和它们相连，如果在图中，（u，v）之间存在一条边，则称（u，v）为边。

source: In some computer networks, multiple communication links between two data centers may be present, as illustrated in Figure 5.
zh_cn: 在某些计算机网络中，两个数据中心之间可能有多重的通信链路，如图5所示。

source: Directed graphs that may have multiple directed edges from a vertex to a second (possibly the same) vertex are used to model such networks. We called such graphs directed multigraphs.
zh_cn: 可以用包含从一个顶点指向第二个（也许是同一个）顶点的多重有向边的有向图来对这样的网络建模，我们称这样的图为有向多重图。

source: When there are m directed edges, each associated to an ordered pair of vertices (u, v), we say that (u, v) is an edge of multiplicity m.
zh_cn: 当m条有向边中的每一条都与顶点有序对（u，v）相关联时，我们称（u，v）是一条多重度为m的边。

source: For some models we may need a graph where some edges are undirected, while others are directed.
zh_cn: 对于某些模型，我们可能需要这样的图，其中有些边是无向的，而另一些边是有向的。

source: A graph with both directed and undirected edges is called a mixed graph.
zh_cn: 既包含有向边又包含无向边的图称为混合图。

source: For example, a mixed graph might be used to model a computer network containing links that operate in both directions and other links that operate only in one direction.
zh_cn: 例如，可能会用一个混合图给这样的计算机网络建模，该网络中包含一些双向的通信链路和另一些单向的通信链路。

source: This terminology for the various types of graphs is summarized in Table 1.
zh_cn: 表1总结了各种图的专用术语。

source: We will sometimes use the term graph as a general term to describe graphs with directed or undirected edges (or both), with or without loops, and with or without multiple edges.
zh_cn: 有时我们将用图作为一个通用的术语指代有向或无向的（或两者皆有）、有环或无环的，以及有多重边或无多重边的图。

source: At other times, when the context is clear, we will use the term graph to refer only to undirected graphs.
zh_cn: 在其他时候，当上下文清楚时，我们使用术语图只表示无向图。

source: Because of the relatively modern interest in graph theory, and because it has applications to a wide variety of disciplines, many different terminologies of graph theory have been introduced.
zh_cn: 因为现代对图论的研究兴趣，还因为其在各个学科的广泛应用，所以图论中引入了许多不同的术语。

source: The reader should determine how such terms are being used whenever they are encountered.
zh_cn: 不管什么时候遇到这些术语，读者应该注意它们的实际含义。

source: The terminology used by mathematicians to describe graphs has been increasingly standardized, but the terminology used to discuss graphs when they are used in other disciplines is still quite varied.
zh_cn: 数学家用以描述图的术语已经逐步得到规范，但是在其他学科用于讨论图的术语仍然多种多样。

source: Although the terminology used to describe graphs may vary, three key questions can help us understand the structure of a graph:
zh_cn: 尽管描述图的术语可能区别很大，但是以下三个问题能够帮助我们理解图的结构：

source: Are the edges of the graph undirected or directed (or both)?
zh_cn: 图的边是有向的还是无向的（还是两者皆有）？

source: If the graph is undirected, are multiple edges present that connect the same pair of vertices?
zh_cn: 如果是无向图，是否存在连接相同顶点对的多重边？

source: If the graph is directed, are multiple directed edges present?
zh_cn: 如果是有向图，是否存在多重有向边？

source: Are loops present?
zh_cn: 是否存在环？

source: Answering such questions helps us understand graphs.
zh_cn: 回答这些问题有助于我们理解图。

source: It is less important to remember the particular terminology used.
zh_cn: 而记住所使用的特定术语就不那么重要。

source: 10.1.1 Graph Models
zh_cn: 10.1.1图模型

source: Graphs are used in a wide variety of models.
zh_cn: 图可用在各种模型里。

source: We began this section by describing how to construct graph models of communications networks linking data centers.
zh_cn: 本节开始部分介绍了如何为链接数据中心的通信网络建模。

source: We will complete this section by describing some diverse graph models for some interesting applications.
zh_cn: 本节后续部分将介绍一些图模型的有趣应用。

source: We will return to many of these applications later in this chapter and in Chapter 11.
zh_cn: 本章的后续小节和第11章还将讨论这些应用。

source: We will introduce additional graph models in subsequent sections of this and later chapters.
zh_cn: 本章的后续部分和后面的章节还要介绍其他模型。

source: Also, recall that directed graph models for some applications were introduced in Chapter 9.
zh_cn: 第9章介绍了某些应用的有向图模型。

source: When we build a graph model, we need to make sure that we have correctly answered the three key questions we posed about the structure of a graph.
zh_cn: 当建立图模型时，需要确认已经正确回答了我们提出的关于图结构的三个关键问题。

source: SOCIAL NETWORKS Graphs are extensively used to model social structures based on different kinds of relationships between people or groups of people.
zh_cn: 社交网络图广泛地应用于为基于人或人群之间不同类型关系的社会结构建模。

source: These social structures, and the graphs that represent them, are known as social networks.
zh_cn: 这些社会结构以及表示它们的图，称为社交网络。

source: In these graph models, individuals or organizations are represented by vertices; relationships between individuals or organizations are represented by edges.
zh_cn: 在这些图模型中，用顶点表示个人或组织，用边表示个人或组织之间的关系。

source: The study of social networks is an extremely active multidisciplinary area, and many different types of relationships between people have been studied using them.
zh_cn: 对社交网络的研究是一个非常活跃的学科，可以使用社交网络研究人们之间很多不同类型的关系。

source: We will introduce some of the most commonly studied social networks here.
zh_cn: 这里我们将介绍一些最常用的社交网络。

source: EXAMPLE 1 Acquaintanceship and Friendship Graphs We can use a simple graph to represent whether two people know each other, that is, whether they are acquainted, or whether they are friends (either in the real world in the virtual world via a social networking site such as Facebook).
zh_cn: 例1交往和朋友关系图可用简单图来表示两个人是否互相认识，即他们是否熟悉或他们是否为朋友（在现实世界中或在虚拟世界中，通过像脸谱一样的社交网络）。

source: Each person in a particular group of people is represented by a vertex.
zh_cn: 用顶点表示具体人群里的每个人。

source: An undirected edge is used to connect two people when these people know each other, when we are concerned only with acquaintanceship, or whether they are friends. No multiple edges and usually no loops are used.
zh_cn: 当两个人互相认识时，用无向边连接这两个人。当我们仅关注是否熟悉或是否为朋友时，不使用多重边，通常也不使用环。

source: (If we want to include the notion of self-knowledge, we would include loops.)
zh_cn: （如果我们想表达“自己认识自己”这层意思，就在图中包含环。）

source: A small acquaintanceship graph is shown in Figure 6.
zh_cn: 图6显示了一个小型交往关系图。

source: The acquaintanceship graph of all people in the world has more than six billion vertices and probably more than one trillion edges!
zh_cn: 世界上所有人的交往关系图有超过60亿个顶点和可能超过1万亿条边！

source: We will discuss this graph further in Section 10.4.
zh_cn: 在10.4节里将要进一步讨论这个图。
